DavidPetrov2023/Zobo/zobo_cam/sdkconfig.defaults
# AI-Thinker ESP32-CAM: 4 MB flash, 4 MB PSRAM.

CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# Whole picture buffers live here; without PSRAM only a thumbnail would fit.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Two app slots. Flashing this board means grounding IO0 by hand, and the robot
# it rides on will not always be within arm's reach, so a new image has to be
# able to arrive over the network - and needs somewhere to land.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# A fresh image must confirm itself once it is up; if it never does, the next
# reset returns to the previous one. This is the only safety net once the
# programmer is out of reach.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# The stream handler holds a socket open for as long as somebody is watching.
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# A brownout during a WiFi transmit is the classic ESP32-CAM symptom of a weak
# 5V supply. Leave the detector on - a reboot loop is a useful warning.
CONFIG_ESP_BROWNOUT_DET=y
